app/controllers/flickr_auth_controller.rb

  def create
   flickr_object.auth.getToken(params[:frob])
   current_user.update_attribute(:flickr_token, flickr_object.auth.token)
---
UPDATE "users" SET "flickr_token" = '--- !ruby/object:Flickr::Token