app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "flickr_token", "remember_token", "login", "email", "created_at") VALUES('', '18a2d6494fc88a3c3fc571cfad3e902ed8370f29', '2008-12-16 17:43:14', '52f9de0134a09fb651c60c35c43826aeae9af643', NULL, NULL, NULL, 'jerrod', 'jerrod@indierockmedia.com', '2008-12-16 17:43:14')